### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-   destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_pet.this will be destroyed
-   resource "random_pet" "this" {
-       id        = "credible-kiwi" -> null
-       length    = 2 -> null
-       separator = "-" -> null
    }

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-core-lambda"
!       last_modified                  = "2023-08-08T02:36:59.672+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:2",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:2" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:2/invocations" -> (known after apply)
!       s3_bucket                      = "credible-kiwi-20230808023642849900000001" -> (known after apply)
+       s3_object_version              = (known after apply)
        tags                           = {}
!       version                        = "2" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "2" -> (known after apply)
!       source_arn          = "arn:aws:execute-api:us-east-1:350131064538:cataprato-http/*/*/*" -> "arn:aws:execute-api:us-east-1:350131064538:69aqdd02bl/*/*/*"
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "unqualified_alias_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       source_arn          = "arn:aws:execute-api:us-east-1:350131064538:cataprato-http/*/*/*" -> "arn:aws:execute-api:us-east-1:350131064538:69aqdd02bl/*/*/*"
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket                 = "credible-kiwi-20230808023642849900000001" -> (known after apply)
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "fcc1d960c20c30b25c0888d7da66c9a7" -> (known after apply)
!       id                     = "lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip" -> (known after apply)
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
-       tags                   = {} -> null
!       tags_all               = {} -> (known after apply)
!       version_id             = "null" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "2925242424112100028" -> (known after apply)
!       triggers = {
!           "timestamp" = "1691462169283279800" -> "1691467282873920000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:2" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-08T02:36:48.084+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:2" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3" -> (known after apply)
!       s3_bucket                   = "credible-kiwi-20230808023642849900000001" -> (known after apply)
+       s3_object_version           = (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "b9Lhpv2S4q8X9Ex3jIPyVgJ7QCSpvOYDghKzDlDhUME=" -> (known after apply)
!       source_code_size            = 27196 -> (known after apply)
!       version                     = "2" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket                 = "credible-kiwi-20230808023642849900000001" -> (known after apply)
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "6c11d331aebbd9c2dbe674d927e7c508" -> (known after apply)
!       id                     = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip" -> (known after apply)
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
-       tags                   = {} -> null
!       tags_all               = {} -> (known after apply)
!       version_id             = "null" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "3323740962882567097" -> (known after apply)
!       triggers = {
!           "timestamp" = "1691462169296643000" -> "1691467282891363000"
            # (1 unchanged element hidden)
        }
    }

  # module.s3_bucket.aws_s3_bucket.this[0] must be replaced
-/+ resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
!       arn                         = "arn:aws:s3:::credible-kiwi-20230808023642849900000001" -> (known after apply)
!       bucket                      = "credible-kiwi-20230808023642849900000001" -> (known after apply)
!       bucket_domain_name          = "credible-kiwi-20230808023642849900000001.s3.amazonaws.com" -> (known after apply)
!       bucket_prefix               = "credible-kiwi-" -> "cataprato-core-"
!       bucket_regional_domain_name = "credible-kiwi-20230808023642849900000001.s3.us-east-1.amazonaws.com" -> (known after apply)
!       hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
!       id                          = "credible-kiwi-20230808023642849900000001" -> (known after apply)
+       policy                      = (known after apply)
!       region                      = "us-east-1" -> (known after apply)
!       request_payer               = "BucketOwner" -> (known after apply)
-       tags                        = {} -> null
!       tags_all                    = {} -> (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

-       grant {
-           id          = "c20555c7d3c8cb7cec2fd9dacdea0f908ba112c4d5934db79995f4ddc3c36ede" -> null
-           permissions = [
-               "FULL_CONTROL",
            ] -> null
-           type        = "CanonicalUser" -> null
        }

-       server_side_encryption_configuration {
-           rule {
-               bucket_key_enabled = false -> null

-               apply_server_side_encryption_by_default {
-                   sse_algorithm = "AES256" -> null
                }
            }
        }

-       versioning {
-           enabled    = true -> null
-           mfa_delete = false -> null
        }
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0] must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
!       bucket                  = "credible-kiwi-20230808023642849900000001" -> (known after apply)
!       id                      = "credible-kiwi-20230808023642849900000001" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.s3_bucket.aws_s3_bucket_versioning.this[0] must be replaced
-/+ resource "aws_s3_bucket_versioning" "this" {
!       bucket = "credible-kiwi-20230808023642849900000001" -> (known after apply)
!       id     = "credible-kiwi-20230808023642849900000001" -> (known after apply)

!       versioning_configuration {
+           mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 10 to add, 1 to change, 11 to destroy.
```
</details>